### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-18T22:24:45.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:47",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:37" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:37/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/23726a00d45fd567e98192d5e486d9b752897c16170c3fa08d82a21fa7a32fea.zip" -> "lambda-builds/607b21823d9c2d2a3b6a68db374d6101fe09e2adfb78b01795a76b4a077b1c92.zip"
!       s3_object_version              = "uj2X9pGBWpO5HVvGB2FysNzTV6mFVW6Q" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "37" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "37" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "022a6fd7d59f554673e0e3b9c0b0f8d3" -> (known after apply)
!       id                     = "lambda-builds/23726a00d45fd567e98192d5e486d9b752897c16170c3fa08d82a21fa7a32fea.zip" -> (known after apply)
!       key                    = "lambda-builds/23726a00d45fd567e98192d5e486d9b752897c16170c3fa08d82a21fa7a32fea.zip" -> "lambda-builds/607b21823d9c2d2a3b6a68db374d6101fe09e2adfb78b01795a76b4a077b1c92.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/23726a00d45fd567e98192d5e486d9b752897c16170c3fa08d82a21fa7a32fea.zip" -> "./.terraform/lambda-builds/607b21823d9c2d2a3b6a68db374d6101fe09e2adfb78b01795a76b4a077b1c92.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "uj2X9pGBWpO5HVvGB2FysNzTV6mFVW6Q" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/src",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/607b21823d9c2d2a3b6a68db374d6101fe09e2adfb78b01795a76b4a077b1c92.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/607b21823d9c2d2a3b6a68db374d6101fe09e2adfb78b01795a76b4a077b1c92.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "3486915595598257739" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/23726a00d45fd567e98192d5e486d9b752897c16170c3fa08d82a21fa7a32fea.zip" -> "./.terraform/lambda-builds/607b21823d9c2d2a3b6a68db374d6101fe09e2adfb78b01795a76b4a077b1c92.zip"
!           "timestamp" = "1692397408330226800" -> "1692407445409482000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "5194723158836279495" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/23726a00d45fd567e98192d5e486d9b752897c16170c3fa08d82a21fa7a32fea.zip" -> "./.terraform/lambda-builds/607b21823d9c2d2a3b6a68db374d6101fe09e2adfb78b01795a76b4a077b1c92.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:47" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-18T22:24:29.061+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:47" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/996b6996ab415ccd0b8db86dfb28215ada00aaba8736393468fae0a3fcb90a96.zip" -> "builds/d20ecd28200876489a1f0ac6ff632dafb33d583384416821c99e48272f8b01f1.zip"
!       s3_object_version           = "pXrkvTZ.perZD.LoH7aUAzT9ArnglC3O" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "FZhkXFIjdbGNXI3OIhqgqutca5rRsnX3eRamAciTZsg=" -> (known after apply)
!       source_code_size            = 29772341 -> (known after apply)
!       version                     = "47" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "9ee1bf3ef42a4f092bec7bb8e75ebc1b-6" -> (known after apply)
!       id                     = "builds/996b6996ab415ccd0b8db86dfb28215ada00aaba8736393468fae0a3fcb90a96.zip" -> (known after apply)
!       key                    = "builds/996b6996ab415ccd0b8db86dfb28215ada00aaba8736393468fae0a3fcb90a96.zip" -> "builds/d20ecd28200876489a1f0ac6ff632dafb33d583384416821c99e48272f8b01f1.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/996b6996ab415ccd0b8db86dfb28215ada00aaba8736393468fae0a3fcb90a96.zip" -> "builds/d20ecd28200876489a1f0ac6ff632dafb33d583384416821c99e48272f8b01f1.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "pXrkvTZ.perZD.LoH7aUAzT9ArnglC3O" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/d20ecd28200876489a1f0ac6ff632dafb33d583384416821c99e48272f8b01f1.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/d20ecd28200876489a1f0ac6ff632dafb33d583384416821c99e48272f8b01f1.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6691860317335791256" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/996b6996ab415ccd0b8db86dfb28215ada00aaba8736393468fae0a3fcb90a96.zip" -> "builds/d20ecd28200876489a1f0ac6ff632dafb33d583384416821c99e48272f8b01f1.zip"
!           "timestamp" = "1692397409918941000" -> "1692407447031898000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "2526415130929704125" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/996b6996ab415ccd0b8db86dfb28215ada00aaba8736393468fae0a3fcb90a96.zip" -> "builds/d20ecd28200876489a1f0ac6ff632dafb33d583384416821c99e48272f8b01f1.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>